frankplow/ELEC3885-SD-Test/src/stm32f4xx_hal_conf.h
/// @file    stm32f4xx_hal_conf.h
/// @author  MCD Application Team
/// @brief   HAL configuration file.

#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

#include "system.h"

#define HAL_MODULE_ENABLED
/* #define HAL_ADC_MODULE_ENABLED */
/* #define HAL_CAN_MODULE_ENABLED */
/* #define HAL_CAN_LEGACY_MODULE_ENABLED */
/* #define HAL_CEC_MODULE_ENABLED   */
/* #define HAL_CRC_MODULE_ENABLED */
/* #define HAL_CRYP_MODULE_ENABLED */
/* #define HAL_DAC_MODULE_ENABLED */
#define HAL_DCMI_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_DMA2D_MODULE_ENABLED
#define HAL_ETH_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
/* #define HAL_NAND_MODULE_ENABLED */
/* #define HAL_NOR_MODULE_ENABLED */
/* #define HAL_PCCARD_MODULE_ENABLED */
/* #define HAL_SRAM_MODULE_ENABLED */
#define HAL_SDRAM_MODULE_ENABLED
/* #define HAL_HASH_MODULE_ENABLED */
#define HAL_GPIO_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
/* #define HAL_I2S_MODULE_ENABLED */
/* #define HAL_IWDG_MODULE_ENABLED */
/* #define HAL_IRDA_MODULE_ENABLED */
#define HAL_LTDC_MODULE_ENABLED
#define HAL_DSI_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
/* #define HAL_QSPI_MODULE_ENABLED    */
#define HAL_RCC_MODULE_ENABLED
/* #define HAL_RNG_MODULE_ENABLED */
/* #define HAL_RTC_MODULE_ENABLED */
/* #define HAL_SAI_MODULE_ENABLED */
#define HAL_SD_MODULE_ENABLED
/* #define HAL_SPI_MODULE_ENABLED */
/* #define HAL_TIM_MODULE_ENABLED */
#define HAL_UART_MODULE_ENABLED
/* #define HAL_USART_MODULE_ENABLED */
/* #define HAL_SMARTCARD_MODULE_ENABLED */
/* #define HAL_WWDG_MODULE_ENABLED */
#define HAL_CORTEX_MODULE_ENABLED
/* #define HAL_PCD_MODULE_ENABLED */
/* #define HAL_HCD_MODULE_ENABLED */
/* #define HAL_SPDIFRX_MODULE_ENABLED */

/**
 * @brief External clock source for I2S peripheral
 *        This value is used by the I2S HAL module to compute the I2S clock
 * source frequency, this source is inserted directly through I2S_CKIN pad.
 */
#if !defined(EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE \
  (12288000U) /*!< Value of the External oscillator in Hz*/
#endif        /* EXTERNAL_CLOCK_VALUE */

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
 * @brief This is the HAL system configuration section
 */
#define VDD_VALUE (3300U)         /*!< Value of VDD in mv */
#define TICK_INT_PRIORITY (0x0FU) /*!< tick interrupt priority */
#define USE_RTOS 0U
#define PREFETCH_ENABLE 1U
#define INSTRUCTION_CACHE_ENABLE 1U

#define USE_HAL_ADC_REGISTER_CALLBACKS \
  0U /* ADC register callback disabled       */
#define USE_HAL_CAN_REGISTER_CALLBACKS \
  0U /* CAN register callback disabled       */
#define USE_HAL_CEC_REGISTER_CALLBACKS \
  0U /* CEC register callback disabled       */
#define USE_HAL_CRYP_REGISTER_CALLBACKS \
  0U /* CRYP register callback disabled      */
#define USE_HAL_DAC_REGISTER_CALLBACKS \
  0U /* DAC register callback disabled       */
#define USE_HAL_DCMI_REGISTER_CALLBACKS \
  0U /* DCMI register callback disabled      */
#define USE_HAL_DFSDM_REGISTER_CALLBACKS \
  0U /* DFSDM register callback disabled     */
#define USE_HAL_DMA2D_REGISTER_CALLBACKS \
  0U /* DMA2D register callback disabled     */
#define USE_HAL_DSI_REGISTER_CALLBACKS \
  0U /* DSI register callback disabled       */
#define USE_HAL_ETH_REGISTER_CALLBACKS \
  0U /* ETH register callback disabled       */
#define USE_HAL_HASH_REGISTER_CALLBACKS \
  0U /* HASH register callback disabled      */
#define USE_HAL_HCD_REGISTER_CALLBACKS \
  0U /* HCD register callback disabled       */
#define USE_HAL_I2C_REGISTER_CALLBACKS \
  0U /* I2C register callback disabled       */
#define USE_HAL_FMPI2C_REGISTER_CALLBACKS \
  0U /* FMPI2C register callback disabled    */
#define USE_HAL_I2S_REGISTER_CALLBACKS \
  0U /* I2S register callback disabled       */
#define USE_HAL_IRDA_REGISTER_CALLBACKS \
  0U /* IRDA register callback disabled      */
#define USE_HAL_LPTIM_REGISTER_CALLBACKS \
  0U /* LPTIM register callback disabled     */
#define USE_HAL_LTDC_REGISTER_CALLBACKS \
  0U /* LTDC register callback disabled      */
#define USE_HAL_MMC_REGISTER_CALLBACKS \
  0U /* MMC register callback disabled       */
#define USE_HAL_NAND_REGISTER_CALLBACKS \
  0U /* NAND register callback disabled      */
#define USE_HAL_NOR_REGISTER_CALLBACKS \
  0U /* NOR register callback disabled       */
#define USE_HAL_PCCARD_REGISTER_CALLBACKS \
  0U /* PCCARD register callback disabled    */
#define USE_HAL_PCD_REGISTER_CALLBACKS \
  0U /* PCD register callback disabled       */
#define USE_HAL_QSPI_REGISTER_CALLBACKS \
  0U /* QSPI register callback disabled      */
#define USE_HAL_RNG_REGISTER_CALLBACKS \
  0U /* RNG register callback disabled       */
#define USE_HAL_RTC_REGISTER_CALLBACKS \
  0U /* RTC register callback disabled       */
#define USE_HAL_SAI_REGISTER_CALLBACKS \
  0U /* SAI register callback disabled       */
#define USE_HAL_SD_REGISTER_CALLBACKS \
  0U /* SD register callback disabled        */
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS \
  0U /* SMARTCARD register callback disabled */
#define USE_HAL_SDRAM_REGISTER_CALLBACKS \
  0U /* SDRAM register callback disabled     */
#define USE_HAL_SRAM_REGISTER_CALLBACKS \
  0U /* SRAM register callback disabled      */
#define USE_HAL_SPDIFRX_REGISTER_CALLBACKS \
  0U /* SPDIFRX register callback disabled   */
#define USE_HAL_SMBUS_REGISTER_CALLBACKS \
  0U /* SMBUS register callback disabled     */
#define USE_HAL_SPI_REGISTER_CALLBACKS \
  0U /* SPI register callback disabled       */
#define USE_HAL_TIM_REGISTER_CALLBACKS \
  0U /* TIM register callback disabled       */
#define USE_HAL_UART_REGISTER_CALLBACKS \
  0U /* UART register callback disabled      */
#define USE_HAL_USART_REGISTER_CALLBACKS \
  0U /* USART register callback disabled     */
#define USE_HAL_WWDG_REGISTER_CALLBACKS \
  0U /* WWDG register callback disabled      */

/* ########################## Assert Selection ############################## */
/**
 * @brief Uncomment the line below to expanse the "assert_param" macro in the
 *        HAL drivers code
 */
/* #define USE_FULL_ASSERT    1U*/

/* ################## Ethernet peripheral configuration for NUCLEO 144 board
 * ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0 2U
#define MAC_ADDR1 0U
#define MAC_ADDR2 0U
#define MAC_ADDR3 0U
#define MAC_ADDR4 0U
#define MAC_ADDR5 0U

/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE \
  ETH_MAX_PACKET_SIZE /* buffer size for receive               */
#define ETH_TX_BUF_SIZE \
  ETH_MAX_PACKET_SIZE    /* buffer size for transmit              */
#define ETH_RXBUFNB (5U) /* 5 Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB (5U) /* 5 Tx buffers of size ETH_TX_BUF_SIZE  */

/* Section 2: PHY configuration section */
/* LAN8742A PHY Address*/
#define LAN8742A_PHY_ADDRESS 0x00U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_RESET_DELAY (0x00000FFFU)
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY (0x00000FFFU)

#define PHY_READ_TO (0x0000FFFFU)
#define PHY_WRITE_TO (0x0000FFFFU)

/* Section 3: Common PHY Registers */

#define PHY_BCR ((uint16_t)0x00) /*!< Transceiver Basic Control Register   */
#define PHY_BSR ((uint16_t)0x01) /*!< Transceiver Basic Status Register    */

#define PHY_RESET ((uint16_t)0x8000)    /*!< PHY Reset */
#define PHY_LOOPBACK ((uint16_t)0x4000) /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M \
  ((uint16_t)0x2100) /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M \
  ((uint16_t)0x2000) /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M \
  ((uint16_t)0x0100) /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M \
  ((uint16_t)0x0000) /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION \
  ((uint16_t)0x1000) /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION \
  ((uint16_t)0x0200) /*!< Restart auto-negotiation function    */
#define PHY_POWERDOWN \
  ((uint16_t)0x0800) /*!< Select the power down mode           */
#define PHY_ISOLATE \
  ((uint16_t)0x0400) /*!< Isolate PHY from MII                 */

#define PHY_AUTONEGO_COMPLETE \
  ((uint16_t)0x0020) /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS \
  ((uint16_t)0x0004) /*!< Valid link established               */
#define PHY_JABBER_DETECTION \
  ((uint16_t)0x0002) /*!< Jabber condition detected            */

/* Section 4: Extended PHY Registers */

#define PHY_SR \
  ((uint16_t)0x1F) /*!< PHY special control/ status register Offset     */

#define PHY_SPEED_STATUS \
  ((uint16_t)0x0004) /*!< PHY Speed mask                                  */
#define PHY_DUPLEX_STATUS \
  ((uint16_t)0x0010) /*!< PHY Duplex mask                                 */

#define PHY_ISFR \
  ((uint16_t)0x1D) /*!< PHY Interrupt Source Flag register Offset       */
#define PHY_ISFR_INT4 \
  ((uint16_t)0x0010) /*!< PHY Link down inturrupt                         */

/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
 * Activated: CRC code is present inside driver
 * Deactivated: CRC code cleaned from driver
 */

#define USE_SPI_CRC 1U

/* Includes ------------------------------------------------------------------*/
/**
 * @brief Include module's header file
 */

#ifdef HAL_RCC_MODULE_ENABLED
#include <stm32f4xx_hal_rcc.h>
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include <stm32f4xx_hal_gpio.h>
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
#include <stm32f4xx_hal_dma.h>
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_CORTEX_MODULE_ENABLED
#include <stm32f4xx_hal_cortex.h>
#endif /* HAL_CORTEX_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
#include <stm32f4xx_hal_adc.h>
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_CAN_MODULE_ENABLED
#include <stm32f4xx_hal_can.h>
#endif /* HAL_CAN_MODULE_ENABLED */

#ifdef HAL_CAN_LEGACY_MODULE_ENABLED
#include <stm32f4xx_hal_can_legacy.h>
#endif /* HAL_CAN_LEGACY_MODULE_ENABLED */

#ifdef HAL_CEC_MODULE_ENABLED
#include <stm32f4xx_hal_cec.h>
#endif /* HAL_CEC_MODULE_ENABLED */

#ifdef HAL_CRC_MODULE_ENABLED
#include <stm32f4xx_hal_crc.h>
#endif /* HAL_CRC_MODULE_ENABLED */

#ifdef HAL_CRYP_MODULE_ENABLED
#include <stm32f4xx_hal_cryp.h>
#endif /* HAL_CRYP_MODULE_ENABLED */

#ifdef HAL_DMA2D_MODULE_ENABLED
#include <stm32f4xx_hal_dma2d.h>
#endif /* HAL_DMA2D_MODULE_ENABLED */

#ifdef HAL_DAC_MODULE_ENABLED
#include <stm32f4xx_hal_dac.h>
#endif /* HAL_DAC_MODULE_ENABLED */

#ifdef HAL_DCMI_MODULE_ENABLED
#include <stm32f4xx_hal_dcmi.h>
#endif /* HAL_DCMI_MODULE_ENABLED */

#ifdef HAL_ETH_MODULE_ENABLED
#include <stm32f4xx_hal_eth.h>
#endif /* HAL_ETH_MODULE_ENABLED */

#ifdef HAL_FLASH_MODULE_ENABLED
#include <stm32f4xx_hal_flash.h>
#endif /* HAL_FLASH_MODULE_ENABLED */

#ifdef HAL_SRAM_MODULE_ENABLED
#include <stm32f4xx_hal_sram.h>
#endif /* HAL_SRAM_MODULE_ENABLED */

#ifdef HAL_NOR_MODULE_ENABLED
#include <stm32f4xx_hal_nor.h>
#endif /* HAL_NOR_MODULE_ENABLED */

#ifdef HAL_NAND_MODULE_ENABLED
#include <stm32f4xx_hal_nand.h>
#endif /* HAL_NAND_MODULE_ENABLED */

#ifdef HAL_PCCARD_MODULE_ENABLED
#include <stm32f4xx_hal_pccard.h>
#endif /* HAL_PCCARD_MODULE_ENABLED */

#ifdef HAL_SDRAM_MODULE_ENABLED
#include <stm32f4xx_hal_sdram.h>
#endif /* HAL_SDRAM_MODULE_ENABLED */

#ifdef HAL_HASH_MODULE_ENABLED
#include <stm32f4xx_hal_hash.h>
#endif /* HAL_HASH_MODULE_ENABLED */

#ifdef HAL_I2C_MODULE_ENABLED
#include <stm32f4xx_hal_i2c.h>
#endif /* HAL_I2C_MODULE_ENABLED */

#ifdef HAL_I2S_MODULE_ENABLED
#include <stm32f4xx_hal_i2s.h>
#endif /* HAL_I2S_MODULE_ENABLED */

#ifdef HAL_IWDG_MODULE_ENABLED
#include <stm32f4xx_hal_iwdg.h>
#endif /* HAL_IWDG_MODULE_ENABLED */

#ifdef HAL_LTDC_MODULE_ENABLED
#include <stm32f4xx_hal_ltdc.h>
#endif /* HAL_LTDC_MODULE_ENABLED */

#ifdef HAL_DSI_MODULE_ENABLED
#include <stm32f4xx_hal_dsi.h>
#endif /* HAL_DSI_MODULE_ENABLED */

#ifdef HAL_PWR_MODULE_ENABLED
#include <stm32f4xx_hal_pwr.h>
#endif /* HAL_PWR_MODULE_ENABLED */

#ifdef HAL_QSPI_MODULE_ENABLED
#include <stm32f4xx_hal_qspi.h>
#endif /* HAL_QSPI_MODULE_ENABLED */

#ifdef HAL_RNG_MODULE_ENABLED
#include <stm32f4xx_hal_rng.h>
#endif /* HAL_RNG_MODULE_ENABLED */

#ifdef HAL_RTC_MODULE_ENABLED
#include <stm32f4xx_hal_rtc.h>
#endif /* HAL_RTC_MODULE_ENABLED */

#ifdef HAL_SAI_MODULE_ENABLED
#include <stm32f4xx_hal_sai.h>
#endif /* HAL_SAI_MODULE_ENABLED */

#ifdef HAL_SD_MODULE_ENABLED
#include <stm32f4xx_hal_sd.h>
#endif /* HAL_SD_MODULE_ENABLED */

#ifdef HAL_SPDIFRX_MODULE_ENABLED
#include <stm32f4xx_hal_spdifrx.h>
#endif /* HAL_SPDIFRX_MODULE_ENABLED */

#ifdef HAL_SPI_MODULE_ENABLED
#include <stm32f4xx_hal_spi.h>
#endif /* HAL_SPI_MODULE_ENABLED */

#ifdef HAL_TIM_MODULE_ENABLED
#include <stm32f4xx_hal_tim.h>
#endif /* HAL_TIM_MODULE_ENABLED */

#ifdef HAL_UART_MODULE_ENABLED
#include <stm32f4xx_hal_uart.h>
#endif /* HAL_UART_MODULE_ENABLED */

#ifdef HAL_USART_MODULE_ENABLED
#include <stm32f4xx_hal_usart.h>
#endif /* HAL_USART_MODULE_ENABLED */

#ifdef HAL_IRDA_MODULE_ENABLED
#include <stm32f4xx_hal_irda.h>
#endif /* HAL_IRDA_MODULE_ENABLED */

#ifdef HAL_SMARTCARD_MODULE_ENABLED
#include <stm32f4xx_hal_smartcard.h>
#endif /* HAL_SMARTCARD_MODULE_ENABLED */

#ifdef HAL_WWDG_MODULE_ENABLED
#include <stm32f4xx_hal_wwdg.h>
#endif /* HAL_WWDG_MODULE_ENABLED */

#ifdef HAL_PCD_MODULE_ENABLED
#include <stm32f4xx_hal_pcd.h>
#endif /* HAL_PCD_MODULE_ENABLED */

#ifdef HAL_HCD_MODULE_ENABLED
#include <stm32f4xx_hal_hcd.h>
#endif /* HAL_HCD_MODULE_ENABLED */

/* Exported macro ------------------------------------------------------------*/
#ifdef USE_FULL_ASSERT
/**
 * @brief  The assert_param macro is used for function's parameters check.
 * @param  expr: If expr is false, it calls assert_failed function
 *         which reports the name of the source file and the source
 *         line number of the call that failed.
 *         If expr is true, it returns no value.
 * @retval None
 */
#define assert_param(expr) \
  ((expr) ? (void)0 : assert_failed((uint8_t*)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4xx_HAL_CONF_H */
